tutorials/fluidSolidInteraction/HronTurekFsi3/ras/0/fluid/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.65;

boundaryField
{
    plate
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform 0.65;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.65;
    }
    cylinder
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform 0.65;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    bottom
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform 0.65;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    top
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform 0.65;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
