tutorials/fluidSolidInteraction/HronTurekFsi3/ras/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
}

gradSchemes
{
    default leastSquares;
}

divSchemes
{
    default none;
    div(phi,U)   Gauss linearUpwind cellLimited leastSquares 1;
    div((nuEff*dev(grad(U).T()))) Gauss linear;
    div(phi,omega) Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,k) Gauss upwind;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default none;
    laplacian(nu,U) Gauss linear corrected;
    laplacian(nuEff,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;
    laplacian(DepsilonEff,epsilon) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;

    laplacian(rAU,p) Gauss linear corrected;
    laplacian(DomegaEff,omega) Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
    interpolate(U) skewCorrected linear;
}

snGradSchemes
{
    default skewCorrected 1;
}

fluxRequired
{
    default no;
    p;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
